### Урок

In [ ]:
import pandas as pd

In [4]:
df = pd.read_csv("World-happiness-report-2024.csv")

Информация о датафрейме

In [ ]:
print(df.info())

In [ ]:
print(df.describe())

Первые - последние строки

In [ ]:
print(df.head())

In [ ]:
print(df.tail())

Определенные столбцы

In [ ]:
print(df[['Country name', 'Regional indicator']])

In [ ]:
print(df.loc[56])

Содержимое определенного столбца в строке

In [ ]:
print(df.loc[56, "Healthy life expectancy"])

Содержимое определенного столбца пор условию

In [ ]:
print(df[df["Healthy life expectancy"] > 0.7])

Модификация данных

In [43]:
df = pd.read_csv("hh.csv")

Добавляем столбец

In [ ]:
df['Test'] = [new for new in range(29)]

print(df)

Удаляем

In [ ]:
df.drop('Test', axis=1, inplace=True)

print(df)

In [ ]:
df.drop(28, axis=0)

print(df)

Анализ

In [ ]:
df = pd.read_csv("animal.csv")

print(df)

In [ ]:
df.info()

Заменяем NaN

In [ ]:
df.fillna(0, inplace=True)

print(df)

Удаляем NaN

In [ ]:
df.dropna(inplace=True)

print(df)

Группировка

In [ ]:
group = df.groupby('Пища')["Средняя продолжительность жизни"].mean()

print(group)

Сохранение результатов

In [45]:
df.to_csv("output.csv", index=False)

### Эксперименты и домашка

#### Титаник

In [58]:
titanic_df = pd.read_csv("titanic.csv")

titanic_df.head()

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [59]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerID  1313 non-null   int64
 1   Name         1313 non-null   object
 2   PClass       1313 non-null   object
 3   Age          756 non-null    float64
 4   Sex          1313 non-null   object
 5   Survived     1313 non-null   int64
 6   SexCode      1313 non-null   int64
dtypes: float64(1), int64(3), object(3)
memory usage: 71.9+ KB

In [60]:
titanic_df.describe()

       PassengerID         Age     Survived      SexCode
count  1313.000000  756.000000  1313.000000  1313.000000
mean    657.000000   30.397989     0.342727     0.351866
std     379.174762   14.259049     0.474802     0.477734
min       1.000000    0.170000     0.000000     0.000000
25%     329.000000   21.000000     0.000000     0.000000
50%     657.000000   28.000000     0.000000     0.000000
75%     985.000000   39.000000     1.000000     1.000000
max    1313.000000   71.000000     1.000000     1.000000

Сколько выжило в контексте мужчин и женщин

In [61]:
print(titanic_df.groupby(['Sex', 'Survived'])['PassengerID'].count())

Sex     Survived
female  0           154
        1           308
male    0           709
        1           142
Name: PassengerID, dtype: int64

#### Зарплата

In [57]:
salary_df = pd.read_csv("dz.csv")
salary_df.head()

    Name    City    Salary
0    Аня   Томск  200000.0
1    Боб  Москва  350000.0
2  Чарли  Москва  270000.0
3   Лиза   Томск   70000.0
4  Настя     NaN   35000.0

In [62]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    12 non-null     object
 1   City    10 non-null     object
 2   Salary  11 non-null     float64
dtypes: float64(1), object(2)
memory usage: 416.0+ bytes

In [64]:
group = salary_df.groupby('City')['Salary'].mean()

print(group)

City
Москва    211400.0
Томск      91250.0
Name: Salary, dtype: float64